// Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.

int[] GetArray(int size, int minValue, int maxValue)
{
    int[] array = new int[size];
    for (int i = 0; i < size; i++)
    {
        array[i] = new Random().Next(minValue, maxValue + 1);
    }
    return array;
}

int[] resultArray = GetArray(10, 10, 100);
Console.WriteLine(String.Join(", ", resultArray));

int GetSum(int[] array)
{
    int sum = 0;
    for (int i = 0; i < array.Length; i += 2)
    {
        sum += array[i];
    }
    return sum;
}

int sumOdd = GetSum(resultArray);
Console.WriteLine($"Сумма элементов, стоящих на нечётных позициях: {sumOdd}");